---
type: PlanCircuitSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# PlanCircuitSet

`Autodesk.Revit.DB.PlanCircuitSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PlanCircuitSet | — | `public PlanCircuitSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( PlanCircuit item )` |
| Method | Erase | — | `public virtual int Erase ( PlanCircuit item )` |
| Method | ForwardIterator | — | `public virtual PlanCircuitSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( PlanCircuit item )` |
| Method | ReverseIterator | — | `public virtual PlanCircuitSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |